validation/diluteCoupledHyperbolicFoam/riser/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication generateMoments
runApplication setFields
runApplication decomposePar
runParallel diluteCoupledHyperbolicFoam
