validation/diluteCoupledHyperbolicFoam/riser/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited     leastSquares .2;
    grad(p)         leastSquares;
}

divSchemes
{
    default                         none;

    div(phi,U)                      Gauss linearUpwind grad(U);
    div(phi,sigma)                  Gauss vanAlbada;

    div(sigma)                      Gauss linear;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
    div((nuM*grad(U)))              Gauss linear;
}

laplacianSchemes
{
    default                         Gauss linear corrected;
}

interpolationSchemes
{
    default                         linear;

    reconstruct(U)                  upwind;
    reconstruct(weight)             upwind;
}

snGradSchemes
{
    default                         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
