validation/diluteCoupledHyperbolicFoam/riser/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    particles
);

boundaries
{
    inlet
    {
        type    cyclic;
    }
    outlet
    {
        type    cyclic;
    }
    walls
    {
        type    zeroGradient;
    }
    frontBack
    {
        type    empty;
    }
}

particles
{
    type                weightsAndAbscissae;
    weightDimension     [0 0 0 0 0 0 0];
    abscissaDimension   [0 1 -1 0 0 0 0];

    internal
    {
        node0
        {
            weight  0.005;
            abscissa (0.01 0);
        }
        node1
        {
            weight  0.005;
            abscissa (-0.01 0);
        }
    }
}


// ************************************************************************* //
